ci-crud/app/Models/AdminModel.php

SELECT `users`.`id` as `userid`, `username`, `email`, `name` as `role`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
---
    public function getAllUser()
    {
        $builder = $this->db->table($this->table);
        $builder->select('users.id as userid, username, email, name as role');
        $builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $result = $builder->get()->getResultObject();

SELECT `users`.`id` as `userid`, `username`, `email`, `name` as `role`, `fullname`, `user_profile` as `user_pfp`, `active`, `force_pass_reset`, `status`, `status_message` `created_at`, `updated_at`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = '3'
---
    public function getUser($id)
    {
        $builder = $this->db->table($this->table);
        $builder->select('users.id as userid, username, email, name as role, fullname, user_profile as user_pfp, active, force_pass_reset, status, status_message created_at, updated_at');
        $builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $result = $builder->getWhere(['users.id' => $id]);