ci-crud/app/Models/NotificationsModel.php

    public function getAll()
    {
        $builder = $this->db->table($this->table);
        $result = $builder->get()->getResult();
---
SELECT *
FROM `notifications`

    public function getById($id)
    {
        $builder = $this->db->table($this->table);
        $builder->where('notif_id', $id);

        return $builder->get()->getResult()[0];
---
SELECT *
FROM `notifications`
WHERE `notif_id` = '31'